#ifndef __oop__
#define __oop__

//------------------------------------------------------------------------------
// oop.h - содержит описание объектно-ориентированного ЯП
//------------------------------------------------------------------------------

#include <fstream>
#include "constants.h"
#include "language.h"

//------------------------------------------------------------------------------
// объектно-ориентированный ЯП
class oop : public language {
public:
    // наследование: одинарное, множественное, интерфейса
    enum inheritance {SINGLE, MULTIPLE, INTERFACE};
    inheritance inhType;

    // Вывод параметров объектно-ориентированного ЯП в форматируемый поток
    void Out(std::ostream &ofst) override;

    // Ввод параметров объектно-ориентированного ЯП
    static language *In(std::istream &ifst);

    // Случайный ввод параметров объектно-ориентированного ЯП
    static oop *random();
};

#endif //__oop__
